[
  {
    "id": "a5d8d94a-3b5c-5b27-801a-8e82edc8b333",
    "title": "Z-CERT Podcast Recording: Zet ‘m op",
    "description": "During WHY2025 we will record a special of our podcast. The central theme of this episode will be: Communities. \nAnd you can be there during the recording of this episode!",
    "start": "2025-08-04T11:00:00+02:00",
    "end": "2025-08-04T14:00:00+02:00",
    "room": "Village:HackTheHealth",
    "url": "https://z-cert.nl/actueel/podcast",
    "type": "Other"
  },
  {
    "id": "a877aa49-6782-593f-9f27-5ff6cdf95581",
    "title": "Transmasc meetup",
    "description": "Hi, I'm Li0n. I'm transmasc, and I'd really like to meet more nerdy transmascs. if you feel the same way, please come say hi :) I might change the exact time and date, so please check again later. if you want to meet me at a different time or place, you can also reach me during the event with DECT 5406",
    "start": "2025-08-04T17:00:00+02:00",
    "end": "2025-08-04T18:00:00+02:00",
    "room": "Village:TechInc",
    "url": "",
    "type": "Meeting"
  },
  {
    "id": "53edd6ac-b620-5ead-af31-0aafbfd9b53a",
    "title": "Transmasc meetup",
    "description": "Hi, I'm Li0n. I'm transmasc, and I'd really like to meet more nerdy transmascs. if you feel the same way, please come say hi :) I might change the exact time and date, so please check again later. if you want to meet me at a different time or place, you can also reach me during the event with DECT 5406",
    "start": "2025-08-05T17:00:00+02:00",
    "end": "2025-08-05T18:00:00+02:00",
    "room": "Village:TechInc",
    "url": "",
    "type": "Meeting"
  },
  {
    "id": "0e6312ec-4271-5527-a9d9-826c8de1a0a2",
    "title": "SUMMALAJNENS SAUNASESSION",
    "description": "Age range: 18+\nONLY BANGERS",
    "start": "2025-08-07T18:00:00+02:00",
    "end": "2025-08-07T19:30:00+02:00",
    "room": "undetermined",
    "url": "",
    "type": "Other"
  },
  {
    "id": "e2ff0891-8a50-5ac9-ace3-4ec07706000c",
    "title": "Onderzoek levering mifi-routers (hardware hacking)",
    "description": "Needs signup\nAge range: Aimed at adults but supervised kids welcome.\nBij de levering van Mifi devices doet zich een vreemde situatie voor. Met behulp van hardware-hacking probeer ik te bevestigen of te ontkrachten of er werkelijk iets speelt.\nDeze talk zal in het Nederlands gegeven worden en is primair voor DutchPicknick-ers. Anderen zijn ook welkom, maar de exacte tijd moet nog even bepaald worden. Zit je niet in DutchPicknick, meldt je vooraf even bij ons village.",
    "start": "2025-08-08T12:00:00+02:00",
    "end": "2025-08-08T12:45:00+02:00",
    "room": "Village:Dutch Picknick",
    "url": "",
    "type": "Talk"
  },
  {
    "id": "f270121d-1826-5927-96b3-a0900d3c8c0a",
    "title": "Self-hosted Dropbox alternatives: The Good, The Bad & The Ugly",
    "description": "Age range: Aimed at adults but supervised kids welcome.\nWelke self-hosted Dropbox alternatieven zijn er eigenlijk? En werkt dat een beetje? Deze talk vergelijkt Seafile, Nextcloud en Pydio Cells. De goede kanten, de slechte, en een paar WTF's.",
    "start": "2025-08-08T13:00:00+02:00",
    "end": "2025-08-08T13:20:00+02:00",
    "room": "Village:Dutch Picknick",
    "url": "",
    "type": "Talk"
  },
  {
    "id": "f6c91348-6ecc-57ca-9031-7d247c0fcc37",
    "title": "FHB: Kefir Making",
    "description": "Needs signup\nAge range: Aimed at adults but supervised kids welcome.\n[https://dud-poll.inf.tu-dresden.de/kefir_why2025/ To secure spot on this workshop please sign in here].\n\n[https://foodhackingbase.org/wiki/Recipe:Kefir_making_manual_-_short_workshop_form Workshop manual is shared here].\n\nThis is hands on workshop during which you will learn how to make, harvest and continue to prepare [https://en.wikipedia.org/wiki/Kefir kefir] using kefir grain culture which you will walk away with if you don't defend yourself too hard. We will explain basic concepts of probiotic, prebiotic and biofilm based polycultures and why it is good to consume foods “labeled” by these terms. You will prepare your own kefir culture, based on the  [https://foodhackingbase.org/wiki/Recipe:Kefir_making_manual_-_short_workshop_form working manual] and take it with you so you will be ready to brew wherever you decide hopefully “positively infecting” your local hackerspace. We will make at least one recipe together, either \"kefir cake\" or kefir smoked paprika spread, if we have time we may do a base for probiotic kefir drink using kefir whey.\n\nWe will demonstrate how to make a new batch of kefir and how to harvest the old one, you will than do it by yourself. The main aim of this workshop is for the participants to understand the principles behind the milk fermentation with kefir culture and not to be afraid to just do it. Combined with the practical experience which I provide you will be able to take care properly about your kefir culture which is the key for your successful long term fermentation adventures! Don't worry too much about loosing a batch or two, that happens from time to time, keeping the \"mother culture\" happy is the important part. As usually there will be tasters, cultures sharing, manuals and various hints how to use the products in alternative ways making for example probiotic drinks from whey, kefir cheese spreads, kefir cake et cetera. I can be also your troubleshooting help if you need it. \n\nThis workshop is donation based no one turned away for lack of funds, if you can chip in around 10€, that would be great but it is up to you.",
    "start": "2025-08-08T14:00:00+02:00",
    "end": "2025-08-08T16:00:00+02:00",
    "room": "Village:Food Hacking Base",
    "url": "foodhackingbase.org",
    "type": "Workshop"
  },
  {
    "id": "06c5bf6a-86c4-5949-bbfb-c8b188236493",
    "title": "FHB:Cheese Rendezvous",
    "description": "Needs signup\nAge range: Aimed at adults but supervised kids welcome.\n[https://dud-poll.inf.tu-dresden.de/cheese1_why/ To secure spot on the Session I. (Day 1, FRI 18h00) please sign in here]\n\n[https://dud-poll.inf.tu-dresden.de/cheese2_why/ To secure spot on the Session 2. (Day 3, SUN 19h00) please sign in here.]\n\n\nEach cheese tasting session is open to 25 people max, please do sign in advance, you can just show up before the event but we are very likely going to be full for this one (like three times overbooked). If you can bring cheese which you made by yourself that would be great! Of course some specific local or extraordinary cheese/s or other related condiments like sun dried tomatoes, good quality olives, mustards, wine all would be appreciated. If you are bringing cheese please do label it well with at least it's name and type of milk used, your nick or name/contact would come handy too. The best would be of course to add short description to our wiki (please check the sample). Still please sign in in advance! FHB will be getting some high quality cheeses to offer basic selection with other samples surrounding it plus some basic condiments. Note that due to the interest in previous years we are going to run two sessions, each one lasting for about two hours or bit over.\n\nThis event is based on '''donation at your will no one turned away for lack of funds'''.\n\nSo lets meet all together again enjoying these lovely creations! Here you can find cheeses which are going to be present, please do add your ones and keep in mind that good half of the cheeses will be not listed here, they will just appear and they are worth of your attention!\n\nTo add your own cheese, add it to the wiki below\n\n[https://foodhackingbase.org/wiki/FHB@WHY2025/Cheese_Rendezvous Click here for a list of cheeses]",
    "start": "2025-08-08T18:00:00+02:00",
    "end": "2025-08-08T20:00:00+02:00",
    "room": "Village:Food Hacking Base",
    "url": "https://foodhackingbase.org/wiki/FHB@WHY2025/Cheese_Rendezvous",
    "type": "Tasting"
  },
  {
    "id": "fc065a67-a125-57d6-b064-c2af5897c855",
    "title": "Creating Artistic PCBs in Kicad",
    "description": "Age range: All ages\n== Workshop Description ==\nFor this workshop, we will look at the various ways to incorporate custom artwork into your PCB design.<br>\nConversation is informal, all questions are welcome!  \n\nWorkshop given by DRC.\n<br>\n<br>\n[[File:HHA_WHY_logo.png|center|300px]]  \n  \n== Complete Hardware Hacking Area Village Schedule == \nWorkshops are all free to attend.<br>\nThe prices in the yellow boxes are the materials costs for participating in the hands-on part of the workshop.<br><br>\n[[File:WHY_HHA_schedule.png|720px]]\n  \n== Location of Hardware Hacking Area Village == \n[[File:HHA_map_WHY.jpg|720px]]",
    "start": "2025-08-08T19:00:00+02:00",
    "end": "2025-08-08T21:00:00+02:00",
    "room": "Village:Hardware Hacking Area",
    "url": "",
    "type": "Workshop"
  },
  {
    "id": "870d51bc-602b-55f1-89c7-9a97153fc4e7",
    "title": "SMD Duck Soldering workshop",
    "description": "Needs signup\nAge range: All ages\n== Workshop Description ==\nLearn SMD soldering by making a duck.\n\nWorkshop given by [[User:Arne|Arne]].\n\nMaterials cost: €10\n\nBatteries not included, you will need 3x AAA batteries. I have a small quantity of batteries available to test your duck. \n  \n== Sign-Up ==\nAt the event, on paper. Please come to the Hardware Hacking Area to sign up and buy the Duck kit.\n\nThere will be more Duck kits than workshop spaces, so you can also buy a kit to solder on your own if you prefer. Printed instructions are included with the kit.\n\n== Complete Hardware Hacking Area Village Schedule == \nWorkshops are all free to attend.<br>\nThe prices in the yellow boxes are the materials costs for participating in the hands-on part of the workshop.<br><br>\n[[File:WHY_HHA_schedule.png|720px]] \n\n== Location of Hardware Hacking Area Village == \n[[File:HHA_map_WHY.jpg|720px]] [[File:HHA_WHY_logo.png|300px]]",
    "start": "2025-08-08T16:30:00+02:00",
    "end": "2025-08-08T18:30:00+02:00",
    "room": "Village:Hardware Hacking Area",
    "url": "",
    "type": "Workshop"
  },
  {
    "id": "2a447fd1-0b53-5702-a216-1d8b3c28584c",
    "title": "Eat pancakes, Sleep, Hack, Repeat",
    "description": "Age range: All ages\n==== We'll be baking pancakes every main event day from 16:00 - 18:00, Bring Your Own Plate! ====\n\nPlease drop by and have a pancake! We're providing the camp with as much pancakes we can physically bake, as long as our supplies last ;-)\n\nThe Pancake village will be right next to the (main) Andromeda track.\n\n'''BYOP''' (Bring your own plate) and enjoy some pancakes with us!",
    "start": "2025-08-08T16:00:00+02:00",
    "end": "2025-08-08T18:00:00+02:00",
    "room": "Village:Pancake",
    "url": "",
    "type": "Other"
  },
  {
    "id": "3420b4a4-7721-5ed6-8c73-fc7e95a2b0ff",
    "title": "Quantum Game Intro",
    "description": "Age range: All ages",
    "start": "2025-08-08T17:00:00+02:00",
    "end": "2025-08-08T18:00:00+02:00",
    "room": "Village:Quantum",
    "url": "",
    "type": "Hands-On"
  },
  {
    "id": "30b50f2d-a379-5dcf-a603-29a54a6173a2",
    "title": "Stargazing",
    "description": "Age range: Aimed at adults but supervised kids welcome.\nLet's go stargazing! \nOn good nights I'll have two telescopes and a pair of binoculars set up, as well as some books about stargazing. \n\nThe moon phase is full or near full. It's a nice sight. \nOther than that we can look at some nice clusters or Saturn which is rising relatively early in the night now. \n\nIf you have your own telescope, bring it too! Let's check out each other's gear.",
    "start": "2025-08-08T23:00:00+02:00",
    "end": "2025-08-09T01:00:00+02:00",
    "room": "Village:Øl Telecom",
    "url": "",
    "type": "Outside"
  },
  {
    "id": "0aa23d84-bb6f-5ff9-b954-feb39509377f",
    "title": "Desk-a-thon",
    "description": "Missing duration, check with organiser, dummy 10 minutes added\nThe main idea is to see if anybody could hack our automated desk and let it do crazy things!",
    "start": "2025-08-08T00:00:00+02:00",
    "end": "2025-08-08T00:10:00+02:00",
    "room": "undetermined",
    "url": "",
    "type": "Hands-On"
  },
  {
    "id": "b08cd997-f4d6-5b99-b217-27176db03f3c",
    "title": "Craft beer brewing!",
    "description": "Age range: Aimed at adults but supervised kids welcome.\nHave you ever been curious about the process behind this amazing drink called beer or do you just like beer in general? We will be brewing a SMaSH (single malt and single hop) beer on site on Day 1 and then enjoy the product on Day 4 on wards.\n\nBeer is brewed using a brewing system and then later served through a cold tap. Make sure to bring some type of container suitable for beer consumption, as there will be a tap available during the brewing session!\n\nLocation is close to the Sauna/Salmiakki.",
    "start": "2025-08-08T18:00:00+02:00",
    "end": "2025-08-08T20:00:00+02:00",
    "room": "undetermined",
    "url": "",
    "type": "Hands-On"
  },
  {
    "id": "c4bc4514-bf3a-59fd-af8a-199e140b770e",
    "title": "Password Cracking - the basics",
    "description": "Age range: Aimed at adults but supervised kids welcome.",
    "start": "2025-08-08T16:00:00+02:00",
    "end": "2025-08-08T16:30:00+02:00",
    "room": "undetermined",
    "url": "",
    "type": "Hands-On"
  },
  {
    "id": "dcb58d79-2038-53b5-87af-6ae22483941c",
    "title": "MTB Rides",
    "description": "",
    "start": "2025-08-09T12:00:00+02:00",
    "end": "2025-08-09T13:30:00+02:00",
    "room": "Camp entrance",
    "url": "",
    "type": "Hands-On"
  },
  {
    "id": "b6072481-e486-5c6e-bfed-945ed8cb7160",
    "title": "Stop the Bleed @ Aid to Ukraine",
    "description": "Needs signup\nAge range: 16+\n= Stop the Bleed - practical skills for daily life in Ukraine =\n\nIn Ukraine, instead of reanimation, most people learn how to stop the bleed, to deal with the aftermath of attacks. \n\nEven though it is not the first thing you might need, learning this skill gives you a good feel for the situation in cities like Kyiv and Kharkiv. \n\n=== Registration ===\n\nRegistration is at the Village! We have about 10-15 places for each session\n\n=== What will I learn? ===\n\nTatiana and her assistant Niels will show you to apply a tourniquet, how to apply hemostatic gauzes in bleeding wounds and how to apply pressure bandage. \n\nAnd you can try all of it yourself with training tourniquets, rubber fake wounds with red fluid and training pressure bandages!\n\n=== How should I prepare? ===\n\nDon't put on your most expensive dress. We have suits to keep your clothes kinda clean, but no warranty. For sure it will be messy, but it will be fun! \n\n=== Can I support this? ===\n\nYes for sure! If you want to support our foundation Aid to Ukraine, you can donate towards stop the bleed-kits which we will bring to Kharkiv. \n\nhttps://aidtoukraine.nl",
    "start": "2025-08-09T14:00:00+02:00",
    "end": "2025-08-09T16:00:00+02:00",
    "room": "Village:Aid to Ukraine",
    "url": "https://aidtoukraine.nl",
    "type": "Workshop"
  },
  {
    "id": "facd9967-eb29-5832-af66-f888d80e5a49",
    "title": "How to get a new TV without paying. Phishing panels for the win!",
    "description": "This presentation will showcase several examples of daily phishing incidents that the Dutch Tax and Customs Administration addresses. The Dutch Tax and Customs Administration receives over 100,000 reports of phishing every year. \nThe second part of the presentation includes a live demo of a phishing panel. Using a phishing panel ensures the phishing victim pays for purchasing a 75\" OLED TV without knowing it. The TV is delivered to the cybercriminal's address. All of this is live on stage.",
    "start": "2025-08-09T14:00:00+02:00",
    "end": "2025-08-09T15:00:00+02:00",
    "room": "Village:Dutch Picknick",
    "url": "",
    "type": "Talk"
  },
  {
    "id": "accb50d8-097f-55b7-b8a7-b95a6069b9c9",
    "title": "FHB:Kimchi making",
    "description": "Needs signup\nAge range: Aimed at adults but supervised kids welcome.\n[https://dud-poll.inf.tu-dresden.de/kimchi_making_why2025/ To secure spot on this workshop please sign in here.]\n\n[https://foodhackingbase.org/wiki/Recipe:Traditional_Kimchi_making_manual Workshop manual is shared here.]\n\nThis is hands on workshop where your learn how to prepare Korean [http://en.wikipedia.org/wiki/Kimchi 김치 (kimchi)]. You will do at least two types of kimchies based on wild/spontaneous fermentation. We will see what type of nice vegetables we will get. Highly likely we will do cabbage kimchi (배추 김치) and then either radish, topinambur or turnip kimchi.\n\nThe preparation of vegetable ferments in Korea, called [https://en.wikipedia.org/wiki/Kimchi “kimchies”], is an ancient fermentation skill based on spontaneous fermentation (naturally occurring lactic acid producing bacteria among the others) and variety of ingredients added. This workshop is a hands-on experience that reviews the basics of Korean kimchi making and today's preparation styles. We will go through the main topics which are salt to vegetables and liquid ratio and when to apply it and how. This one is crucial. We will explain the importance of the effect of ginger, garlic and spicy pepper and their roles in preventing unwanted microbial development. Part of this workshop is tasting of kimchi samples so you get idea what should your results taste like. You will be leaving with jar of kimchi and knowledge how to make your own.\n\nThis workshop is based on \"donation at your will no one turned away for lack of funds\". Part of the workshop benefits goes towards fhb budget and hopefully larger part towards [[User:Algoldor|Algoldor's]] pocket to cover participation costs at WHY 2025 event and if some extras are accumulated, then towards current and future fermentation projects.",
    "start": "2025-08-09T14:00:00+02:00",
    "end": "2025-08-09T16:00:00+02:00",
    "room": "Village:Food Hacking Base",
    "url": "https://foodhackingbase.org/index.php?title=FHB@WHY2025/kimchi_making&action=edit&redlink=1",
    "type": "Workshop"
  },
  {
    "id": "bd23a86a-9f13-5e08-a456-253aa722c049",
    "title": "FHB:Cider Flows",
    "description": "Needs signup\nAge range: 18+\n[https://dud-poll.inf.tu-dresden.de/cider_flows1_why2025/ Session I. Day 2 18h30 to secure spot on this guided tasting workshop please sign in here.]\n\n[https://dud-poll.inf.tu-dresden.de/cider_flows_why2025/ Session II. Day 4, 18h30, to secure spot on this guided tasting workshop please sign in here.]\n\n\nThis event is dedicated to cider, cidre, sidra or how ever you would like to call beverage prepared by fermentation of apple juice. This event is run by František [[User:Algoldor|Algoldor]] Apfelbeck and is one of the activities of the [https://cidreriejara.com/wiki/Main_Page Cidrerie Jara/Kvasírna Jara] project which is a commercial one. \n\n'''Aims&Selection'''\nThe aim of this event is to educate people about cider in a nice and socially friendly environment. It is guided tasting with short foreword and then after opening first bottle just continuing with other ones when talking on the subject of cider and it's making. We provide a high quality selection of ciders focusing on \"typical\" products, plus we add some really special samples depending what we have available. At the core of the tasting are French ciders, especially from Normandie region and partly Bretagne. From the geographical point of view we generally have at least one sample from North of Spain, Andalusia or Basque. There is cider from England, because of strong connections to Czech Republic we try to have there one from there and generally we include at least one [https://en.wikipedia.org/wiki/Apfelwein German Apfelweine], the rest depends what interesting samples we get. From the point of view of style of production we are selecting mostly the more \"complex\" \"natural ciders\" made from cider apples, if possible without any additives, unfiltered and secondary fermented in the bottle (prise de mousse naturelle). That would be the highest end. It is however hard to make whole tasting in quality like this so we also get small scale bio/organic production. These are good quality ciders which may be for example filtered, some enzymes added, sulfur etc. We generally include one classic big scale commercial cider for comparison. To increase a bit of spectrum of what can be done we like to have some flavoured ciders, like raspberry cider, honey cider etc. We do like to include one or two [https://fr.wikipedia.org/wiki/Poir%C3%A9 poirés (perry)] into the selection. It happens quite often that it is the first poiré which people had in their life and if you are not in the region or you don't have next to you really good alcohol shop it is really hard to get a high quality one. To finish the tasting we have at least one or two cider related products like pommeau, calvados or vinegar.\n\n'''Style'''\nThis tasting workshop is based on \"donation at your will no one turned away for lack of funds\" creed. However please keep in mind that samples and ingredients for this event will be around 150-200 eu and ending up in a decent plus would help covering costs related to my, [[User:Algoldor|Algoldor]], presence at this event. This is a guided tasting. During the presentation we talk about the cider in general as mentioned above. At the beginning of the tasting it is explained how to taste and evaluate the product properly. We talk about the proper shape of glasses, temperature of serving, preparing the pallet and so on. We discuss also the colour, difference of astringency, bitterness and acidity, levels of sparkliness and more. Concerning the products we start with the extra-bruts and we go in the direction of increasing sweetness towards bruts, demi-secs and douce. We try to make a list of ciders which we taste at the event with the contact details so you can get them if you like. At the end of the event we offer [https://cidreriejara.com/wiki/Main_Page Cidrerie Jara's ciders] and other products for sale for suggested donation in a legal manner so you can get a receipt, the taxes are paid. However we are trying to avoid \"commercialization\" of the CCC events, so it is rather about getting a bottle or two and buying more later on through delivery, inviting us to do cider tasting at your place or getting stock of bottles stocked for your local hackerspace.\n\nThis tasting event is based on \"donation at your will no one turned away for lack of funds\". Part of the workshop benefits goes towards fhb budget and hopefully larger part towards [[User:Algoldor|Algoldor's]] pocket to cover participation costs at WHY 2025 event and if some extras are accumulated, then towards current and future fermentation projects.\n\nFor a list of ciders go to [[https://foodhackingbase.org/wiki/FHB@WHY2025/cider_flows|the food hacking base page of this session]]",
    "start": "2025-08-09T18:30:00+02:00",
    "end": "2025-08-09T20:30:00+02:00",
    "room": "Village:Food Hacking Base",
    "url": "https://foodhackingbase.org/wiki/FHB@WHY2025/cider_flows",
    "type": "Tasting"
  },
  {
    "id": "1ea55f29-1d42-55de-8a05-90515eaa2618",
    "title": "FHB:Chips & Crisps",
    "description": "Needs signup\nAge range: All ages\n[https://dud-poll.inf.tu-dresden.de/chipsAndcrips/][https://dud-poll.inf.tu-dresden.de/chipsAndcrips/ To secure spot on the Session. (Day 4, 16h30) please sign in here.]\n\nThe core idea is to get home made and commercial chips&crisps of high quality and as many varieties and flavours into one spot at same time as possible and then just enjoy. Below are suggestions how could we do it.\n\nTo see and/or add your Chips/Crisps go to [https://foodhackingbase.org/wiki/FHB@WHY2025/chips_crisps| List of Chips/Crisps]",
    "start": "2025-08-09T16:30:00+02:00",
    "end": "2025-08-09T18:30:00+02:00",
    "room": "Village:Food Hacking Base",
    "url": "https://foodhackingbase.org/wiki/FHB@WHY2025/chips_crisps",
    "type": "Tasting"
  },
  {
    "id": "80836f77-2119-59d9-93a7-bacfa5419fd3",
    "title": "Past Presentation Cinema",
    "description": "",
    "start": "2025-08-09T14:00:00+02:00",
    "end": "2025-08-09T17:00:00+02:00",
    "room": "Village:HackTheHealth",
    "url": "",
    "type": "Other"
  },
  {
    "id": "b8010a71-9138-59e9-ba12-1d60922e1cc8",
    "title": "STRIDE into Healthcare: Threat Modeling with AAPS and OpenAPS",
    "description": "Join us for a practical, hands-on workshop focused on threat modeling in the healthcare space — specifically targeting open-source medical devices like the Android Artificial Pancreas System (AAPS) and OpenAPS. Whether you're a hacker, healthcare professional, or security researcher, this session will boost your ability to think critically about medical device risks from both engineering and cybersecurity perspectives.\n\nWe'll explore a blended approach using tools like Attack Trees, INCLUDESNODIRT and STRIDE uncover potential failure points, attack surfaces, and security weaknesses in real-world scenarios. Participants will work together to collaboratively model threats, identify risks, and (if time allows) see if mitigations exist today. The insights generated will be shared back with the OpenAPS community to help improve real-world patient safety.\nNo prior threat modeling experience is required — just bring your curiosity and a willingness to tinker with one of the most fascinating intersections of healthcare and cybersecurity. By the end, you’ll walk away with new skills, a structured threat modeling mindset, and a deeper appreciation of why cybersecurity in healthcare truly matters.",
    "start": "2025-08-09T16:30:00+02:00",
    "end": "2025-08-09T17:30:00+02:00",
    "room": "Village:HackTheHealth",
    "url": "",
    "type": "Workshop"
  },
  {
    "id": "c3f09cae-5561-58e7-bfdd-20eaa5e579a3",
    "title": "KiCad for Beginners",
    "description": "Age range: All ages\n== Workshop Description ==\n[[File:KiCad-Logo.svg.png|thumb]]\nLearn to make your own PCBs with **KiCad**, a free and open source tool that anyone can learn.  \n* Bring your own computer, ideally also a mouse\n* Please install KiCad9 before the workshop\n** KiCad8 or even KiCad7 are also acceptable if your distro does not have KiCad9\n** Linux users can also go for a FlatPak install of KiCad\n** Most distros have extra packages for the library, sometimes they are not installed automatically. Make sure you have them as well (does not apply to Windows or Mac users)\n*** kicad-symbols\n*** kicad-footprints\n*** kicad-packages3D\n* The workshop consist of 15-20 minutes introduction and demo, then you will replicate the demo\n** A handout will help you to remember all the steps\n** Experienced KiCad users will be there to answer all your questions\n** At the end of the workshop you will have designed a functional PCB \n* It will teach you how to\n** create a schematic drawing\n** assign physical components (footprints)\n** place them on the board\n** layout (routing) of the board\n** ordering\n** and various bit and tricks\n* It will not include electronics design stuff. We focus on the usage of the software\n\nThe handout for the workshop can be found here: https://gitlab.com/evils/kicad-workshop/-/blob/main/handout.pdf (you don't need to prepare it, I will bring plenty of copies)\n\nWorkshop given by cpresser\n<br>\n<br>\n[[File:HHA_WHY_logo.png|center|300px]]  \n  \n== Complete Hardware Hacking Area Village Schedule == \nWorkshops are all free to attend.<br>\nThe prices in the yellow boxes are the materials costs for participating in the hands-on part of the workshop.<br><br>\n[[File:WHY_HHA_schedule.png|720px]]\n  \n== Location of Hardware Hacking Area Village == \n[[File:HHA_map_WHY.jpg|720px]]",
    "start": "2025-08-09T15:00:00+02:00",
    "end": "2025-08-09T17:00:00+02:00",
    "room": "Village:Hardware Hacking Area",
    "url": "",
    "type": "Workshop"
  },
  {
    "id": "5ccbf243-6e97-54ac-8e13-8a54d61ab85b",
    "title": "IoT with Arduino Cloud: Beginner-Friendly Workshop",
    "description": "Age range: All ages\n== Workshop Description ==\nIoT with Arduino Cloud. For total beginners.  \n\nWorkshop given by Jeffrey Roe.  \n\nMaterials cost: €25\n<br>\n<br>\n[[File:HHA_WHY_logo.png|center|300px]]  \n  \n== Complete Hardware Hacking Area Village Schedule == \nWorkshops are all free to attend.<br>\nThe prices in the yellow boxes are the materials costs for participating in the hands-on part of the workshop.<br><br>\n[[File:WHY_HHA_schedule.png|720px]]\n  \n== Location of Hardware Hacking Area Village == \n[[File:HHA_map_WHY.jpg|720px]]",
    "start": "2025-08-09T17:30:00+02:00",
    "end": "2025-08-09T19:30:00+02:00",
    "room": "Village:Hardware Hacking Area",
    "url": "",
    "type": "Workshop"
  },
  {
    "id": "4bd9bdbb-3013-5e62-852d-f29190a7c62c",
    "title": "Eat pancakes, Sleep, Hack, Repeat",
    "description": "Age range: All ages\n==== We'll be baking pancakes every main event day from 16:00 - 18:00, Bring Your Own Plate! ====\n\nPlease drop by and have a pancake! We're providing the camp with as much pancakes we can physically bake, as long as our supplies last ;-)\n\nThe Pancake village will be right next to the (main) Andromeda track.\n\n'''BYOP''' (Bring your own plate) and enjoy some pancakes with us!",
    "start": "2025-08-09T16:00:00+02:00",
    "end": "2025-08-09T18:00:00+02:00",
    "room": "Village:Pancake",
    "url": "",
    "type": "Other"
  },
  {
    "id": "b55f43fa-6211-5da5-ba50-5bcde9cac339",
    "title": "Vinyl Cutting & Arts & Crafts",
    "description": "Age range: All ages\n= Hack-je-zakje =\n\n(Hack your bag)..actually more a makers thing but still fun to do ;-)\n\n== Heat Transfer Vinyl Cutting & Arts & Crafts ==\nI'm bringing my small transfer press and vinyl cutter (a Brother Scan 'N Cut, not something self-built unfortunately...) and several little bags (made from an assortment of upcycled coloured fabrics) to decorate.\n\n* '''Please note:''' All materials (Heat transfer vinyl, bags, fabric, etc.) come from my personal stash, a small donation to help cover material costs is very much appreciated - just leave whatever feels fair to you!\n* '''Concerning kids:''' Kids are welcome! But '''only''' with parents or adult supervision. Any unattended 'free-range' children will be politely redirected back to their designated adult faster than you can say \"where did I put that child?\". ;-)\n\n\nIf you're interested, drop by '''Pancake village'''! You're welcome to create or bring a design and decorate your shirt, bag, or whatever you want. \n\nIf you'd like to use my equipment, I do ask that you:\n* Respect the WHY2025 code of conduct \"Be excellent to each other!\" and be mindful about your designs: [[Code_of_Conduct]]\n* Decorate at your own risk - once pressed, you '''cannot remove''' the vinyl and might have to live with imperfections. But hey, you've made something custom and unique! ;-)\n* Be very careful with the transfer press - it gets '''HOT!''' (130-160°C). Kids cannot use the press without supervision!\n* Only press cotton, polyester/cotton blends or nylon items! Other fabrics generally don't play nice with the heat and could melt or won't work with the vinyl I'm bringing. When in doubt, ask me to check the fabric label first so we can adjust the temperature accordingly.\n\n=== Practical info ===\n* I'll be around most of the time, but if you don't see me, ask around Pancake village for '''Distels''' or poke me on IRC\n* I'll bring small bags (for dice, card decks, or small knick-knacks) and fabric that you can decorate and, if you like, hand-sew into something. Or you can bring your own items to decorate. \n* As long the items are 100% cotton, a polyester/cotton blend, polyester or nylon, it'll work with the vinyl I'm bringing.\n* You can bring your own design files in SVG, PNG or JPG format, GIMP works fine for this, and we can try to convert those to .fcm with varying success. \n* Simple designs in SVG or PNG with thick lines and black/white work best. Unfortunately .FCM is Brother proprietary and my plotter works only with these files\n* Please please please... don't hack (or break) my setup. I will probably keep everything offline but USB sticks can do damage too ;-)\n* Your design needs to be mirrored, especially if you're using text. Unless you like it backwards ;-)\n* I will '''try''' to provide a laptop or pc on which to convert designs from .PNG/.SVG to .FCM or to make small adjustments before cutting\n\n=== Other stuff I'm probably bringing ===\n* Assorted yarn, crochet/knitting needles and other fiberart related stuff\n* Random craft supplies (paper, glue, scissors, colored pencils, etc.)\n* Hand-sewing supplies \n\n=== Tips if you want to decorate a shirt  ===\n* I'm not bringing any blanco shirts since I cannot predict your size and don't have a stock, but you can get some at the local shops: Zeeman, Action and HEMA have, not too expensive, T-shirts and aren't too far from our campsite (check [[Facilities]]). \n\nJoin me for some relaxing old-school arts and crafts. You are welcome!",
    "start": "2025-08-09T10:00:00+02:00",
    "end": "2025-08-09T16:00:00+02:00",
    "room": "Village:Pancake",
    "url": "",
    "type": "Hands-On"
  },
  {
    "id": "07b7411c-0104-59ef-85ac-cdec92d21f0c",
    "title": "Quantum programming",
    "description": "",
    "start": "2025-08-09T15:00:00+02:00",
    "end": "2025-08-09T16:00:00+02:00",
    "room": "Village:Quantum",
    "url": "",
    "type": "Hands-On"
  },
  {
    "id": "aa90c64d-6cfa-5c5a-8bdf-0c2b5a7d6606",
    "title": "Quantum Computers: The ultimate hacking machines",
    "description": "Age range: All ages",
    "start": "2025-08-09T12:00:00+02:00",
    "end": "2025-08-09T13:00:00+02:00",
    "room": "Village:Quantum",
    "url": "",
    "type": "Talk"
  },
  {
    "id": "3bfe9dd4-37c4-58c6-8911-10213e79987f",
    "title": "Quantum Game UnJam",
    "description": "Age range: All ages",
    "start": "2025-08-09T14:00:00+02:00",
    "end": "2025-08-09T14:30:00+02:00",
    "room": "Village:Quantum",
    "url": "",
    "type": "Hands-On"
  },
  {
    "id": "c6168c49-f110-539a-8275-a41a31da5f6e",
    "title": "Quantum Game UnJam",
    "description": "Age range: All ages",
    "start": "2025-08-09T17:00:00+02:00",
    "end": "2025-08-09T18:00:00+02:00",
    "room": "Village:Quantum",
    "url": "",
    "type": "Hands-On"
  },
  {
    "id": "fd33faf5-c7ed-56b3-b973-51862e5f6f34",
    "title": "Yiquan training",
    "description": "Age range: All ages",
    "start": "2025-08-09T10:00:00+02:00",
    "end": "2025-08-09T11:00:00+02:00",
    "room": "Village:Quantum",
    "url": "",
    "type": "Other"
  },
  {
    "id": "895c1116-247d-5ad3-bf52-ff2a2ede2d75",
    "title": "Movie-night",
    "description": "Age range: All ages\n⚠️⚠️ We do not own a lot of chairs, if you want to join and be comfortable: bring your own chair.\n\n⚠️⚠️ I'm bringing 2kg of kernel corns, popcorn delivery will be FIFO (no refills, be mindful of other campers opportunity too).\n\n🍿 WHAT: We will project one film with English subtitles and make popcorn kernels explode applying heat to make them edible and delicious.\n\n🍿 WHERE: SSH village.\n\n🍿 WHEN: https://wiki.why2025.org/Village:SSH_(Spanish_Speaking_Hackers)#Schedule\n\n🍿 WHY: Yes, WHY 2025",
    "start": "2025-08-09T21:00:00+02:00",
    "end": "2025-08-09T23:00:00+02:00",
    "room": "Village:SSH (Spanish Speaking Hackers)",
    "url": "https://wiki.why2025.org/Village:SSH_(Spanish_Speaking_Hackers)#Schedule",
    "type": "Movie"
  },
  {
    "id": "1256d744-6061-5744-859e-a13abc747e36",
    "title": "Beer exchange",
    "description": "Age range: 18+\nBeer Exchange at Our Village – Share What You Love!\n\nAt the Camp, people from all over the world come together — and many of us share a passion for great beer.\nLocal brews often reflect the character of a place, but some are so small-scale you’ll never find them online or in shops.\n\nThat’s why we’re hosting a beer exchange in our village!\n\nBring a few special beers from your hometown — the quirky, the rare, the traditional — and swap them with fellow enthusiasts.\nLet’s share stories, flavors, and maybe even organize a casual tasting session together.\n\nThis is your chance to discover beers you'd never find outside your region — unless you're here, at this Camp.\n\n---- Timeslots will follow ----",
    "start": "2025-08-09T16:00:00+02:00",
    "end": "2025-08-09T17:30:00+02:00",
    "room": "Village:Schrottkompott",
    "url": "",
    "type": "Meeting"
  },
  {
    "id": "65e0dbf8-5282-50da-ab23-c3f86c0f63b6",
    "title": "Yolocation: How to pop up a virtualisation infrastructure on a lawn",
    "description": "",
    "start": "2025-08-09T14:00:00+02:00",
    "end": "2025-08-09T14:30:00+02:00",
    "room": "Village:Yolocation",
    "url": "",
    "type": "Guided tour"
  },
  {
    "id": "eca3a244-673f-5c82-80be-81ddff062a06",
    "title": "Stargazing",
    "description": "Age range: Aimed at adults but supervised kids welcome.\nLet's go stargazing! \nOn good nights I'll have two telescopes and a pair of binoculars set up, as well as some books about stargazing. \n\nThe moon phase is full or near full. It's a nice sight. \nOther than that we can look at some nice clusters or Saturn which is rising relatively early in the night now. \n\nIf you have your own telescope, bring it too! Let's check out each other's gear.",
    "start": "2025-08-09T23:00:00+02:00",
    "end": "2025-08-10T01:00:00+02:00",
    "room": "Village:Øl Telecom",
    "url": "",
    "type": "Outside"
  },
  {
    "id": "1992e8ca-fa20-559f-a056-da9f234038cc",
    "title": "MTB Rides",
    "description": "",
    "start": "2025-08-10T12:00:00+02:00",
    "end": "2025-08-10T14:00:00+02:00",
    "room": "Camp entrance",
    "url": "",
    "type": "Hands-On"
  },
  {
    "id": "a715e8a8-0370-51e8-9b1c-4e0320d87946",
    "title": "Stop the Bleed @ Aid to Ukraine",
    "description": "Needs signup\nAge range: 16+\n= Stop the Bleed - practical skills for daily life in Ukraine =\n\nIn Ukraine, instead of reanimation, most people learn how to stop the bleed, to deal with the aftermath of attacks. \n\nEven though it is not the first thing you might need, learning this skill gives you a good feel for the situation in cities like Kyiv and Kharkiv. \n\n=== Registration ===\n\nRegistration is at the Village! We have about 10-15 places for each session\n\n=== What will I learn? ===\n\nTatiana and her assistant Niels will show you to apply a tourniquet, how to apply hemostatic gauzes in bleeding wounds and how to apply pressure bandage. \n\nAnd you can try all of it yourself with training tourniquets, rubber fake wounds with red fluid and training pressure bandages!\n\n=== How should I prepare? ===\n\nDon't put on your most expensive dress. We have suits to keep your clothes kinda clean, but no warranty. For sure it will be messy, but it will be fun! \n\n=== Can I support this? ===\n\nYes for sure! If you want to support our foundation Aid to Ukraine, you can donate towards stop the bleed-kits which we will bring to Kharkiv. \n\nhttps://aidtoukraine.nl",
    "start": "2025-08-10T14:00:00+02:00",
    "end": "2025-08-10T16:00:00+02:00",
    "room": "Village:Aid to Ukraine",
    "url": "https://aidtoukraine.nl",
    "type": "Workshop"
  },
  {
    "id": "e95a6e02-f6a0-5f27-8980-61b01f8dba58",
    "title": "Kraftwerk and Craftwork",
    "description": "Age range: 16+\nCome and join us at the Back to the 80s party village for some Kraftwerk and Craftwork! This workshop consists of two parts. First we'll dive into the interesting lyrics of the German music group \"Kraftwerk\". Already in the 1980s, they were working on data ethics. What can we, 45 years later, learn from them? Let's discuss that together (even if you're not familiar with Kraftwerk yet)! Inspired by this band, we'll then continue with the second part: craftwork! We will provide the materials so you can create your own album cover art, for your own imaginary (techno-critical?) band! :)",
    "start": "2025-08-10T15:30:00+02:00",
    "end": "2025-08-10T17:00:00+02:00",
    "room": "Village:Back to the 80s Party",
    "url": "",
    "type": "Workshop"
  },
  {
    "id": "2be61ca3-52a9-5d21-816f-e44866d0f59f",
    "title": "Alpha137: the mini-project",
    "description": "Age range: All ages\nHow a single number (137!) became a math and funny quest.\n- Live demo on DM15C calculator and HP15 Simulator\n- Fundamental constants, maths and more.\n- Informal discussion and Q&A\n- Bonus: free stickers for participants !",
    "start": "2025-08-10T11:00:00+02:00",
    "end": "2025-08-10T11:30:00+02:00",
    "room": "Village:Brittany Fairies",
    "url": "éé.net/alpha137",
    "type": "Discussion"
  },
  {
    "id": "351cba5d-b709-53c3-b2b6-ad91ae01248a",
    "title": "Aspie & Disability Survival Kit (with Lou)",
    "description": "Age range: All ages\nHow we designed our disability cards to make daily life easier.\n- Card design + real-life feedback\n- Open discussion on accessibility and neurodiversity\n- Sharing tools, resources and tips",
    "start": "2025-08-10T11:00:00+02:00",
    "end": "2025-08-10T11:30:00+02:00",
    "room": "Village:Brittany Fairies",
    "url": "",
    "type": "Discussion"
  },
  {
    "id": "bec4af29-7911-5a46-a8a0-ce7b18248d56",
    "title": "Python3-based editors in Burp Suite",
    "description": "This talk covers the Burp Suite extensions Piper and Scalpel. [[User:Nico|Nico]] will show how to use them in order to easily view and modify some data encrypted with AES-ECB.",
    "start": "2025-08-10T17:00:00+02:00",
    "end": "2025-08-10T17:30:00+02:00",
    "room": "Village:Cyber Saiyan",
    "url": "https://hackademy.agarri.fr/freebies",
    "type": "Talk"
  },
  {
    "id": "6a83107a-5d58-517c-937c-ea315f3b4b9b",
    "title": "FHB:Cheese Rendezvous",
    "description": "Needs signup\nAge range: Aimed at adults but supervised kids welcome.\n[https://dud-poll.inf.tu-dresden.de/cheese1_why/ To secure spot on the Session I. (Day 1, FRI 18h00) please sign in here]\n\n[https://dud-poll.inf.tu-dresden.de/cheese2_why/ To secure spot on the Session 2. (Day 3, SUN 19h00) please sign in here.]\n\n\nEach cheese tasting session is open to 25 people max, please do sign in advance, you can just show up before the event but we are very likely going to be full for this one (like three times overbooked). If you can bring cheese which you made by yourself that would be great! Of course some specific local or extraordinary cheese/s or other related condiments like sun dried tomatoes, good quality olives, mustards, wine all would be appreciated. If you are bringing cheese please do label it well with at least it's name and type of milk used, your nick or name/contact would come handy too. The best would be of course to add short description to our wiki (please check the sample). Still please sign in in advance! FHB will be getting some high quality cheeses to offer basic selection with other samples surrounding it plus some basic condiments. Note that due to the interest in previous years we are going to run two sessions, each one lasting for about two hours or bit over.\n\nThis event is based on '''donation at your will no one turned away for lack of funds'''.\n\nSo lets meet all together again enjoying these lovely creations! Here you can find cheeses which are going to be present, please do add your ones and keep in mind that good half of the cheeses will be not listed here, they will just appear and they are worth of your attention!\n\nTo add your own cheese, add it to the wiki below\n\n[https://foodhackingbase.org/wiki/FHB@WHY2025/Cheese_Rendezvous Click here for a list of cheeses]",
    "start": "2025-08-10T19:00:00+02:00",
    "end": "2025-08-10T21:00:00+02:00",
    "room": "Village:Food Hacking Base",
    "url": "https://foodhackingbase.org/wiki/FHB@WHY2025/Cheese_Rendezvous",
    "type": "Tasting"
  },
  {
    "id": "3f7c933f-dfde-5599-b30a-50dd7d8c469f",
    "title": "Past Presentation Cinema",
    "description": "",
    "start": "2025-08-10T14:00:00+02:00",
    "end": "2025-08-10T17:00:00+02:00",
    "room": "Village:HackTheHealth",
    "url": "",
    "type": "Other"
  },
  {
    "id": "24332a0d-f302-53c1-80ef-0e5aac9189c7",
    "title": "Build Your Own Air Quality Sensor",
    "description": "Age range: All ages\n== Workshop Description ==\nBuild Your Own Air Quality Sensor  \n\nWorkshop given by Jeffrey Roe  \n\nMaterials cost: €60\n<br>\n<br>\n[[File:HHA_WHY_logo.png|center|300px]]  \n  \n== Complete Hardware Hacking Area Village Schedule == \nWorkshops are all free to attend.<br>\nThe prices in the yellow boxes are the materials costs for participating in the hands-on part of the workshop.<br><br>\n[[File:WHY_HHA_schedule.png|720px]]\n  \n== Location of Hardware Hacking Area Village == \n[[File:HHA_map_WHY.jpg|720px]]",
    "start": "2025-08-10T19:00:00+02:00",
    "end": "2025-08-10T21:00:00+02:00",
    "room": "Village:Hardware Hacking Area",
    "url": "",
    "type": "Workshop"
  },
  {
    "id": "22e21fd9-5956-51ef-80e2-39d8c9f8b03e",
    "title": "Milliways' Whiskyleaks",
    "description": "Milliways' famous Whiskyleaks event; Self organizing, repeating, turned into a legend. Many bottles arrive, none leave. Bring a bottle of your favourite whisky (or other spirits) and share it with other passionate drinkers. If you can’t bring a bottle, come along - bring one next time!",
    "start": "2025-08-10T18:30:00+02:00",
    "end": "2025-08-10T21:30:00+02:00",
    "room": "Village:Milliways",
    "url": "https://wiki.milliways.info/index.php?title=WHY_2025",
    "type": ""
  },
  {
    "id": "82996347-5893-5bfe-9612-38170f3fe47b",
    "title": "Eat pancakes, Sleep, Hack, Repeat",
    "description": "Age range: All ages\n==== We'll be baking pancakes every main event day from 16:00 - 18:00, Bring Your Own Plate! ====\n\nPlease drop by and have a pancake! We're providing the camp with as much pancakes we can physically bake, as long as our supplies last ;-)\n\nThe Pancake village will be right next to the (main) Andromeda track.\n\n'''BYOP''' (Bring your own plate) and enjoy some pancakes with us!",
    "start": "2025-08-10T16:00:00+02:00",
    "end": "2025-08-10T18:00:00+02:00",
    "room": "Village:Pancake",
    "url": "",
    "type": "Other"
  },
  {
    "id": "f99b2807-36b9-5c00-8b55-68ea104b2cd7",
    "title": "Quantum programming",
    "description": "",
    "start": "2025-08-10T12:00:00+02:00",
    "end": "2025-08-10T13:00:00+02:00",
    "room": "Village:Quantum",
    "url": "",
    "type": "Hands-On"
  },
  {
    "id": "93d63ef1-8008-5cb8-bb32-a87cd7c8ee21",
    "title": "Talk + AMA: Quantum Computers and Cryptography",
    "description": "Age range: All ages",
    "start": "2025-08-10T17:00:00+02:00",
    "end": "2025-08-10T18:00:00+02:00",
    "room": "Village:Quantum",
    "url": "",
    "type": "Talk"
  },
  {
    "id": "977701cb-4015-53c8-a48c-6de3e6b4c7ec",
    "title": "Videogame-tournament",
    "description": "Age range: All ages\nkeywords: videogames\ntags:videogames\n👾 WHAT: We are bringing retro games + game controllers + a projector to play:\n\n🟡 [https://www.youtube.com/watch?v=7ahz87n4oEA Neo Geo Puzzle Money Exchanger]\n\n👾 WHERE: Milliways or SSH village (Projector to be tested on site).\n\n👾 WHEN: https://wiki.why2025.org/Village:SSH_(Spanish_Speaking_Hackers)#Videogame_tournament\n\n👾 WHY: Why not?",
    "start": "2025-08-10T21:00:00+02:00",
    "end": "2025-08-10T23:00:00+02:00",
    "room": "Village:SSH (Spanish Speaking Hackers)",
    "url": "https://wiki.why2025.org/Village:SSH_(Spanish_Speaking_Hackers)#Schedule",
    "type": "Game"
  },
  {
    "id": "ffe92218-8814-578e-bab5-41566940d0e0",
    "title": "Stargazing",
    "description": "Age range: Aimed at adults but supervised kids welcome.\nLet's go stargazing! \nOn good nights I'll have two telescopes and a pair of binoculars set up, as well as some books about stargazing. \n\nThe moon phase is full or near full. It's a nice sight. \nOther than that we can look at some nice clusters or Saturn which is rising relatively early in the night now. \n\nIf you have your own telescope, bring it too! Let's check out each other's gear.",
    "start": "2025-08-10T23:00:00+02:00",
    "end": "2025-08-11T01:00:00+02:00",
    "room": "Village:Øl Telecom",
    "url": "",
    "type": "Outside"
  },
  {
    "id": "5832e552-fd06-5148-8014-ad0d96b644db",
    "title": "MTB Rides",
    "description": "",
    "start": "2025-08-11T12:00:00+02:00",
    "end": "2025-08-11T14:00:00+02:00",
    "room": "Camp entrance",
    "url": "",
    "type": "Hands-On"
  },
  {
    "id": "b004701b-7fdf-5225-974a-3b121ab88718",
    "title": "Stop the Bleed @ Aid to Ukraine",
    "description": "Needs signup\nAge range: 16+\n= Stop the Bleed - practical skills for daily life in Ukraine =\n\nIn Ukraine, instead of reanimation, most people learn how to stop the bleed, to deal with the aftermath of attacks. \n\nEven though it is not the first thing you might need, learning this skill gives you a good feel for the situation in cities like Kyiv and Kharkiv. \n\n=== Registration ===\n\nRegistration is at the Village! We have about 10-15 places for each session\n\n=== What will I learn? ===\n\nTatiana and her assistant Niels will show you to apply a tourniquet, how to apply hemostatic gauzes in bleeding wounds and how to apply pressure bandage. \n\nAnd you can try all of it yourself with training tourniquets, rubber fake wounds with red fluid and training pressure bandages!\n\n=== How should I prepare? ===\n\nDon't put on your most expensive dress. We have suits to keep your clothes kinda clean, but no warranty. For sure it will be messy, but it will be fun! \n\n=== Can I support this? ===\n\nYes for sure! If you want to support our foundation Aid to Ukraine, you can donate towards stop the bleed-kits which we will bring to Kharkiv. \n\nhttps://aidtoukraine.nl",
    "start": "2025-08-11T14:00:00+02:00",
    "end": "2025-08-11T16:00:00+02:00",
    "room": "Village:Aid to Ukraine",
    "url": "https://aidtoukraine.nl",
    "type": "Workshop"
  },
  {
    "id": "1b1c53a6-1140-5e42-8093-ca03fd5e8659",
    "title": "FHB:Cider Flows",
    "description": "Needs signup\nAge range: 18+\n[https://dud-poll.inf.tu-dresden.de/cider_flows1_why2025/ Session I. Day 2 18h30 to secure spot on this guided tasting workshop please sign in here.]\n\n[https://dud-poll.inf.tu-dresden.de/cider_flows_why2025/ Session II. Day 4, 18h30, to secure spot on this guided tasting workshop please sign in here.]\n\n\nThis event is dedicated to cider, cidre, sidra or how ever you would like to call beverage prepared by fermentation of apple juice. This event is run by František [[User:Algoldor|Algoldor]] Apfelbeck and is one of the activities of the [https://cidreriejara.com/wiki/Main_Page Cidrerie Jara/Kvasírna Jara] project which is a commercial one. \n\n'''Aims&Selection'''\nThe aim of this event is to educate people about cider in a nice and socially friendly environment. It is guided tasting with short foreword and then after opening first bottle just continuing with other ones when talking on the subject of cider and it's making. We provide a high quality selection of ciders focusing on \"typical\" products, plus we add some really special samples depending what we have available. At the core of the tasting are French ciders, especially from Normandie region and partly Bretagne. From the geographical point of view we generally have at least one sample from North of Spain, Andalusia or Basque. There is cider from England, because of strong connections to Czech Republic we try to have there one from there and generally we include at least one [https://en.wikipedia.org/wiki/Apfelwein German Apfelweine], the rest depends what interesting samples we get. From the point of view of style of production we are selecting mostly the more \"complex\" \"natural ciders\" made from cider apples, if possible without any additives, unfiltered and secondary fermented in the bottle (prise de mousse naturelle). That would be the highest end. It is however hard to make whole tasting in quality like this so we also get small scale bio/organic production. These are good quality ciders which may be for example filtered, some enzymes added, sulfur etc. We generally include one classic big scale commercial cider for comparison. To increase a bit of spectrum of what can be done we like to have some flavoured ciders, like raspberry cider, honey cider etc. We do like to include one or two [https://fr.wikipedia.org/wiki/Poir%C3%A9 poirés (perry)] into the selection. It happens quite often that it is the first poiré which people had in their life and if you are not in the region or you don't have next to you really good alcohol shop it is really hard to get a high quality one. To finish the tasting we have at least one or two cider related products like pommeau, calvados or vinegar.\n\n'''Style'''\nThis tasting workshop is based on \"donation at your will no one turned away for lack of funds\" creed. However please keep in mind that samples and ingredients for this event will be around 150-200 eu and ending up in a decent plus would help covering costs related to my, [[User:Algoldor|Algoldor]], presence at this event. This is a guided tasting. During the presentation we talk about the cider in general as mentioned above. At the beginning of the tasting it is explained how to taste and evaluate the product properly. We talk about the proper shape of glasses, temperature of serving, preparing the pallet and so on. We discuss also the colour, difference of astringency, bitterness and acidity, levels of sparkliness and more. Concerning the products we start with the extra-bruts and we go in the direction of increasing sweetness towards bruts, demi-secs and douce. We try to make a list of ciders which we taste at the event with the contact details so you can get them if you like. At the end of the event we offer [https://cidreriejara.com/wiki/Main_Page Cidrerie Jara's ciders] and other products for sale for suggested donation in a legal manner so you can get a receipt, the taxes are paid. However we are trying to avoid \"commercialization\" of the CCC events, so it is rather about getting a bottle or two and buying more later on through delivery, inviting us to do cider tasting at your place or getting stock of bottles stocked for your local hackerspace.\n\nThis tasting event is based on \"donation at your will no one turned away for lack of funds\". Part of the workshop benefits goes towards fhb budget and hopefully larger part towards [[User:Algoldor|Algoldor's]] pocket to cover participation costs at WHY 2025 event and if some extras are accumulated, then towards current and future fermentation projects.\n\nFor a list of ciders go to [[https://foodhackingbase.org/wiki/FHB@WHY2025/cider_flows|the food hacking base page of this session]]",
    "start": "2025-08-11T18:30:00+02:00",
    "end": "2025-08-11T20:30:00+02:00",
    "room": "Village:Food Hacking Base",
    "url": "https://foodhackingbase.org/wiki/FHB@WHY2025/cider_flows",
    "type": "Tasting"
  },
  {
    "id": "ffbedd9d-737c-544c-8b6c-2343d9fe93c8",
    "title": "Past Presentation Cinema",
    "description": "",
    "start": "2025-08-11T14:00:00+02:00",
    "end": "2025-08-11T17:00:00+02:00",
    "room": "Village:HackTheHealth",
    "url": "",
    "type": "Other"
  },
  {
    "id": "5524d6f2-b109-5b63-9eb0-e3b7ed452795",
    "title": "Sensing the World Around you with EMF! Solder Workshop (duplicate session)",
    "description": "Age range: All ages\n== Workshop Description ==\nThe EMF Explorer Badge is an electromagnetic field sensing circuit that lets you listen to the world of hidden electromagnetic frequencies around you. Learn more about the electronics world by exploring the sounds they make! The EMF badge also serves as a piece of wearable art and can be worn on a lanyard for extra bling.  \n  \nThrough-hole soldering required for this workshop. This kit is designed for everyone and is accessible to all skill levels. Adult assistance required for youth who are new to soldering.  \n\nWorkshop given by DRC.  \n\nMaterials cost: €10 - €25\n<br>\n<br>\n[[File:HHA_WHY_logo.png|center|300px]]  \n  \n== Complete Hardware Hacking Area Village Schedule == \nWorkshops are all free to attend.<br>\nThe prices in the yellow boxes are the materials costs for participating in the hands-on part of the workshop.<br><br>\n[[File:WHY_HHA_schedule.png|720px]]\n  \n== Location of Hardware Hacking Area Village == \n[[File:HHA_map_WHY.jpg|720px]]",
    "start": "2025-08-11T11:30:00+02:00",
    "end": "2025-08-11T13:30:00+02:00",
    "room": "Village:Hardware Hacking Area",
    "url": "https://darcyneal.com/emf-explorer-badge/",
    "type": "Workshop"
  },
  {
    "id": "610acfdd-e519-5503-8677-06fb0d913c56",
    "title": "Repair and Rework Circuits",
    "description": "Age range: All ages\n== Workshop Description ==\n[[File:IKEA-LANESPELARE-Controller-PCB-825x510.jpg|thumb]]\n<br>\n'''Learn to repair and rework circuits!'''\n* We will practice to un-solder and re-solder components\n* Both SMD- and conventional Through-Hole-Components\n** You will notice that - contrary to popular belief - SMD components are easier to work with\n* Please bring your own ~~trash~~board to practice on\n** I will bring some broken PCBs as well\n* If you prefer your own tools, bring them (soldering iron, tweezers, flux, ...)\n* If you got time, watch/skip through this video before: https://media.ccc.de/v/gpn22-317-42-tricks-frs-smd-lten-nummer-23-wird-sie-berraschen-\n\n<br>\n<hr>\n[[File:HHA_WHY_logo.png|center|300px]]  \n  \n== Complete Hardware Hacking Area Village Schedule == \nWorkshops are all free to attend.<br>\nThe prices in the yellow boxes are the materials costs for participating in the hands-on part of the workshop.<br><br>\n[[File:WHY_HHA_schedule.png|720px]]\n  \n== Location of Hardware Hacking Area Village == \n[[File:HHA_map_WHY.jpg|720px]]",
    "start": "2025-08-11T14:00:00+02:00",
    "end": "2025-08-11T15:00:00+02:00",
    "room": "Village:Hardware Hacking Area",
    "url": "",
    "type": "Workshop"
  },
  {
    "id": "3c52004f-c34a-5701-80ae-a1027aca3c91",
    "title": "Build Your Own Satellite Ground Station",
    "description": "Age range: All ages\n== Workshop Description ==\nAre you fascinated by space and want to learn how to receive data from satellites and weather probes? In this TinyGS station workshop, you’ll build and program your ground station and antenna to receive data from space. This hands-on, beginner-friendly workshop is perfect for anyone interested in radio, electronics, IOT, antenna design, and space exploration.\nTinyGS is an open community-run network of ground stations distributed around the world to receive and operate LoRa satellites, weather probes, and other flying objects, using cheap and versatile modules. With a TinyGS ground station, you can receive data from a variety of sources, such as CubeSats.\nDuring the workshop, you’ll learn how to build and program a TinyGS ground station and a quarter-wave ground plane antenna. No prior experience is required.  \n  \nWorkshop given by Jeffrey Roe.  \n\nMaterials cost: €80\n<br>\n<br>\n[[File:HHA_WHY_logo.png|center|300px]]  \n  \n== Complete Hardware Hacking Area Village Schedule == \nWorkshops are all free to attend.<br>\nThe prices in the yellow boxes are the materials costs for participating in the hands-on part of the workshop.<br><br>\n[[File:WHY_HHA_schedule.png|720px]]\n  \n== Location of Hardware Hacking Area Village == \n[[File:HHA_map_WHY.jpg|720px]]",
    "start": "2025-08-11T16:00:00+02:00",
    "end": "2025-08-11T18:00:00+02:00",
    "room": "Village:Hardware Hacking Area",
    "url": "",
    "type": "Workshop"
  },
  {
    "id": "2b1e61ee-eabf-5e27-b11d-35aeefe8993c",
    "title": "Solder a Pathlighter Badge",
    "description": "Age range: All ages\n== Workshop Description == \nThe Pathlighter PCB, initially known as the Glow Club PCB, is a wearable piece of PCB art crafted for the community.\nIt serves a dual purpose: as a practical tool for teaching about LEDs and soldering, and as a creative demonstration of using a PCB’s foundational layers to craft a unique art piece. Designed to be worn on a lanyard, the Pathlighter PCB acts as a beacon, lighting up the night and ensuring safety for its wearers.  \n  \nThis innovative PCB made its debut in an electronics education group and has since been featured in soldering workshops at ToorCamp 2022 and Chaos Communication Camp ’23. Its design is particularly well-suited for larger events where workshop demand often outstrips available resources. The Pathlighter PCB’s efficient design allows newcomers to complete their project in approximately 20 minutes. This swift completion rate creates a “revolving door” dynamic in the workshop, allowing for a continuous flow of participants and maximizing educational outreach.  \n  \nHaving been taught to over 450 students so far, the Pathlighter PCB workshop has been a delightful experience to teach students how to solder and to earn a unique wearable art piece. Each participant not only learns valuable skills but also becomes an honorary member of the Glow Club. May we all shine brighter together through these shared experiences.  \n  \nWorkshop given by DRC  \n\nMaterials cost: €10 - €15\n<br>\n<br>\n[[File:HHA_WHY_logo.png|center|300px]]  \n  \n== Complete Hardware Hacking Area Village Schedule == \nWorkshops are all free to attend.<br>\nThe prices in the yellow boxes are the materials costs for participating in the hands-on part of the workshop.<br><br>\n[[File:WHY_HHA_schedule.png|720px]]\n\n== Location of Hardware Hacking Area Village == \n[[File:HHA_map_WHY.jpg|720px]]",
    "start": "2025-08-11T18:30:00+02:00",
    "end": "2025-08-11T20:30:00+02:00",
    "room": "Village:Hardware Hacking Area",
    "url": "https://darcyneal.com/pathlighter-pcb/",
    "type": "Workshop"
  },
  {
    "id": "0db7bc21-451a-50d2-b298-2b12e7fd3879",
    "title": "Synth Meetup",
    "description": "Age range: All ages\n[[File:SynthCollage.jpg|left|300px]]  \n\nLet's get together and geek out over music synthesizers, music synthesis, making sound, and creating music. Hardware, software - anything goes! All are welcome to come and talk synths, play synths, share projects, learn, and share. Some attendees have made their own synths at WHY - please bring them! Please feel free to bring any synth or sound-making device.  \n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n[[File:HHA_WHY_logo.png|center|300px]]  \n  \n== Complete Hardware Hacking Area Village Schedule == \nWorkshops are all free to attend.<br>\nThe prices in the yellow boxes are the materials costs for participating in the hands-on part of the workshop.<br><br>\n[[File:WHY_HHA_schedule.png|720px]]\n  \n== Location of Hardware Hacking Area Village == \n[[File:HHA_map_WHY.jpg|720px]]",
    "start": "2025-08-11T21:00:00+02:00",
    "end": "2025-08-11T23:00:00+02:00",
    "room": "Village:Hardware Hacking Area",
    "url": "",
    "type": "Meeting"
  },
  {
    "id": "e4c58c1c-d859-5a8d-8ef7-39e1e1e06b64",
    "title": "Eat pancakes, Sleep, Hack, Repeat",
    "description": "Age range: All ages\n==== We'll be baking pancakes every main event day from 16:00 - 18:00, Bring Your Own Plate! ====\n\nPlease drop by and have a pancake! We're providing the camp with as much pancakes we can physically bake, as long as our supplies last ;-)\n\nThe Pancake village will be right next to the (main) Andromeda track.\n\n'''BYOP''' (Bring your own plate) and enjoy some pancakes with us!",
    "start": "2025-08-11T16:00:00+02:00",
    "end": "2025-08-11T18:00:00+02:00",
    "room": "Village:Pancake",
    "url": "",
    "type": "Other"
  },
  {
    "id": "99b274ea-ed86-5a0b-8f99-04c40f4c8afc",
    "title": "Introduction to Quantum",
    "description": "",
    "start": "2025-08-11T17:00:00+02:00",
    "end": "2025-08-11T18:00:00+02:00",
    "room": "Village:Quantum",
    "url": "",
    "type": "Talk"
  },
  {
    "id": "c040814d-b88f-55d4-8409-891840e55c34",
    "title": "WIQD",
    "description": "Age range: All ages",
    "start": "2025-08-11T12:00:00+02:00",
    "end": "2025-08-11T13:00:00+02:00",
    "room": "Village:Quantum",
    "url": "",
    "type": "Talk"
  },
  {
    "id": "47409f40-3997-5404-befe-1d8fb88cb949",
    "title": "Tiq Taq Toe Finale",
    "description": "Age range: All ages",
    "start": "2025-08-11T19:00:00+02:00",
    "end": "2025-08-11T20:00:00+02:00",
    "room": "Village:Quantum",
    "url": "",
    "type": "Game"
  },
  {
    "id": "b5b89561-8776-56ca-ba94-53a7709e03bb",
    "title": "Yiquan training",
    "description": "Age range: All ages",
    "start": "2025-08-11T10:00:00+02:00",
    "end": "2025-08-11T11:00:00+02:00",
    "room": "Village:Quantum",
    "url": "",
    "type": "Other"
  },
  {
    "id": "555cd6ce-7342-5e7c-bc76-9d3711b5ad7f",
    "title": "Stargazing",
    "description": "Age range: Aimed at adults but supervised kids welcome.\nLet's go stargazing! \nOn good nights I'll have two telescopes and a pair of binoculars set up, as well as some books about stargazing. \n\nThe moon phase is full or near full. It's a nice sight. \nOther than that we can look at some nice clusters or Saturn which is rising relatively early in the night now. \n\nIf you have your own telescope, bring it too! Let's check out each other's gear.",
    "start": "2025-08-11T23:00:00+02:00",
    "end": "2025-08-12T01:00:00+02:00",
    "room": "Village:Øl Telecom",
    "url": "",
    "type": "Outside"
  },
  {
    "id": "55ffd24a-967b-5324-8035-bf75b54fcf9d",
    "title": "MTB Rides",
    "description": "",
    "start": "2025-08-12T12:00:00+02:00",
    "end": "2025-08-12T14:00:00+02:00",
    "room": "Camp entrance",
    "url": "",
    "type": "Hands-On"
  },
  {
    "id": "20e7c0cc-fb48-57a5-b3e2-fb1d7c18d3b9",
    "title": "Stop the Bleed @ Aid to Ukraine",
    "description": "Needs signup\nAge range: 16+\n= Stop the Bleed - practical skills for daily life in Ukraine =\n\nIn Ukraine, instead of reanimation, most people learn how to stop the bleed, to deal with the aftermath of attacks. \n\nEven though it is not the first thing you might need, learning this skill gives you a good feel for the situation in cities like Kyiv and Kharkiv. \n\n=== Registration ===\n\nRegistration is at the Village! We have about 10-15 places for each session\n\n=== What will I learn? ===\n\nTatiana and her assistant Niels will show you to apply a tourniquet, how to apply hemostatic gauzes in bleeding wounds and how to apply pressure bandage. \n\nAnd you can try all of it yourself with training tourniquets, rubber fake wounds with red fluid and training pressure bandages!\n\n=== How should I prepare? ===\n\nDon't put on your most expensive dress. We have suits to keep your clothes kinda clean, but no warranty. For sure it will be messy, but it will be fun! \n\n=== Can I support this? ===\n\nYes for sure! If you want to support our foundation Aid to Ukraine, you can donate towards stop the bleed-kits which we will bring to Kharkiv. \n\nhttps://aidtoukraine.nl",
    "start": "2025-08-12T14:00:00+02:00",
    "end": "2025-08-12T16:00:00+02:00",
    "room": "Village:Aid to Ukraine",
    "url": "https://aidtoukraine.nl",
    "type": "Workshop"
  },
  {
    "id": "f9ffecbc-30d5-53c5-aa5a-70895006aaa5",
    "title": "SMD Duck Soldering workshop",
    "description": "Needs signup\nAge range: All ages\n== Workshop Description ==\nLearn SMD soldering by making a duck.\n\nWorkshop given by [[User:Arne|Arne]].\n\nMaterials cost: €10\n\nBatteries not included, you will need 3x AAA batteries. I have a small quantity of batteries available to test your duck. \n  \n== Sign-Up ==\nAt the event, on paper. Please come to the Hardware Hacking Area to sign up and buy the Duck kit.\n\nThere will be more Duck kits than workshop spaces, so you can also buy a kit to solder on your own if you prefer. Printed instructions are included with the kit.\n\n== Complete Hardware Hacking Area Village Schedule == \nWorkshops are all free to attend.<br>\nThe prices in the yellow boxes are the materials costs for participating in the hands-on part of the workshop.<br><br>\n[[File:WHY_HHA_schedule.png|720px]] \n\n== Location of Hardware Hacking Area Village == \n[[File:HHA_map_WHY.jpg|720px]] [[File:HHA_WHY_logo.png|300px]]",
    "start": "2025-08-12T14:00:00+02:00",
    "end": "2025-08-12T16:00:00+02:00",
    "room": "Village:Hardware Hacking Area",
    "url": "",
    "type": "Workshop"
  },
  {
    "id": "e94d1044-0ed5-56cf-83bd-4b18f8aa653a",
    "title": "Stonehenge Soldering Challenge",
    "description": "Age range: All ages\n== Workshop Description ==\n[[File:Stonehenge.png]]\nIncrease and test your soldering skills with this challenge in the shape of Stonehenge.<br>\n* Prior soldering experience helps, but is not mandatory\n* The components are mounted in an unorthodox way making this a unique challenge\n* Kit includes\n** Empty PCB\n** A 3D-printed multipurpose base\n*** Nice base to display the finished board\n*** Store components during assembly\n*** Protect the finished board for transport by placing it upside down\n** All the components including some spares\n* Because this is a last-minute-project, some things are not perfect\n** There is no software yet to actually light up the LEDs (help wanted, will most likely change during the event)\n** The Microcontroller has not been verified to work yet\n\n  * Materials cost: €5 to €10\n\nWorkshop given by cpresser.<br>\n<br>\n<hr>\n<br>\n[[File:HHA_WHY_logo.png|center|300px]]  \n  \n== Complete Hardware Hacking Area Village Schedule == \nWorkshops are all free to attend.<br>\nThe prices in the yellow boxes are the materials costs for participating in the hands-on part of the workshop.<br><br>\n[[File:WHY_HHA_schedule.png|720px]]\n  \n== Location of Hardware Hacking Area Village == \n[[File:HHA_map_WHY.jpg|720px]]",
    "start": "2025-08-12T11:30:00+02:00",
    "end": "2025-08-12T13:30:00+02:00",
    "room": "Village:Hardware Hacking Area",
    "url": "",
    "type": "Workshop"
  },
  {
    "id": "c9dcb88f-7213-52d8-a702-f5c3530b8c4b",
    "title": "Quantum programming",
    "description": "",
    "start": "2025-08-12T12:00:00+02:00",
    "end": "2025-08-12T13:00:00+02:00",
    "room": "Village:Quantum",
    "url": "",
    "type": "Hands-On"
  },
  {
    "id": "d3955452-461d-5b0f-96e0-3e3ac7dbad7a",
    "title": "Healthcare Meetup: For those working for or in healthcare",
    "description": "Missing duration, check with organiser, dummy 10 minutes added",
    "start": "2025-08-12T19:30:00+02:00",
    "end": "2025-08-12T19:40:00+02:00",
    "room": "undetermined",
    "url": "",
    "type": "Other"
  },
  {
    "id": "1a67a64a-534f-5c2e-800b-dc6aa69cf4b5",
    "title": "MTB Rides",
    "description": "",
    "start": "2025-08-13T12:00:00+02:00",
    "end": "2025-08-13T13:30:00+02:00",
    "room": "Camp entrance",
    "url": "",
    "type": "Hands-On"
  },
  {
    "id": "1cbfa312-a152-5160-a55e-e60fc7e93624",
    "title": "Whiskyleaks",
    "description": "Generated time to make session visible, might need an actual date and time",
    "start": "2025-08-13T00:00:00+02:00",
    "end": "2025-08-13T01:00:00+02:00",
    "room": "undetermined",
    "url": "",
    "type": "whiskyleaks"
  },
  {
    "id": "a8fcd5a9-d40f-54ab-88dc-308d3551270f",
    "title": "Mini RopeJam",
    "description": "Generated time to make session visible, might need an actual date and time\nThis would be in addition to the [official schedule rope jam https://program.why2025.org/why2025/talk/NVCRLH/] on the Sunday.\n\nA rope jam is an open, unstructured space for tying, practicing, or learning together. You can come alone, with a partner, or in a small group. Attendees are encouraged to: self tie, seek others to tie with, be tied by, switch with, observe or talk rope with.\n\nThese self organised rope jams will be ad-hoc throughout the weekend (you're also free to come tie any time).\nThe schedule will be on the whiteboard in our village.",
    "start": "2025-08-13T00:00:00+02:00",
    "end": "2025-08-13T01:00:00+02:00",
    "room": "undetermined",
    "url": "",
    "type": ""
  },
  {
    "id": "6820b505-c2af-55b1-9091-a98dd571014e",
    "title": "Build Your Own Meshtastic Pager (One That Doesn’t Explode)",
    "description": "Generated time to make session visible, might need an actual date and time\nWe're gonna build a non exploding buzzer working on the Meshtastic network",
    "start": "2025-08-13T00:00:00+02:00",
    "end": "2025-08-13T01:00:00+02:00",
    "room": "undetermined",
    "url": "",
    "type": "Workshop"
  },
  {
    "id": "e27daea4-ae7b-562c-83b9-e63c676b8177",
    "title": "KiCad workshop featuring the Fab lib",
    "description": "Generated time to make session visible, might need an actual date and time",
    "start": "2025-08-13T00:00:00+02:00",
    "end": "2025-08-13T01:00:00+02:00",
    "room": "undetermined",
    "url": "https://gitlab.fabcloud.org/pub/libraries/electronics/kicad",
    "type": "Workshop"
  },
  {
    "id": "32a9e8b6-c127-5317-a86a-a3edd46551b5",
    "title": "Play the Pinball machine and set a High Score",
    "description": "Generated time to make session visible, might need an actual date and time\nOngoing (when available) in the Back to the 80s Village.\nYou may play on this Bally 1973 Monte Carlo pinball machine, with max. 4 players.",
    "start": "2025-08-13T00:00:00+02:00",
    "end": "2025-08-13T01:00:00+02:00",
    "room": "undetermined",
    "url": "",
    "type": "Game"
  },
  {
    "id": "2cfecc93-5986-50ee-8c24-4b28a74cbec5",
    "title": "Batik T-Shirts",
    "description": "Generated time to make session visible, might need an actual date and time\nIs for kids\n= About =\n\n[[File:Hippybatik.jpg|frame]]\n\nWe will create some wonderful batik t-shirts during the camp. Everybody is welcome - it could be a kids session but we also have t-shirts for grown ups.\nWe've done some batik sessions on other camps in the past but somehow lost focus the last years. So this is a revival :-)\n\n= What do we provide =\n\nWe've special organic batik color, binding threads and lot's of white t-shirts. But feel free to bring your own t-shirt - everything is possible! This session is provided for free, feel free to donate at the camp side.\n\n* ~40 kids t-shirts in different sizes (5y-14y)\n* ~40 grown up shirts in different sizes (M-3XL)\n* ~40 fitted grown up shirts in different sizes (S-XXL)",
    "start": "2025-08-13T00:00:00+02:00",
    "end": "2025-08-13T01:00:00+02:00",
    "room": "undetermined",
    "url": "",
    "type": "Hands-On"
  },
  {
    "id": "eed855bc-bf50-5a93-9a12-4014b0855aa9",
    "title": "Board gaming - Star Wars Imperial Assault Skirmish",
    "description": "Age range: All ages\nFun 1v1 game sessions for new and experienced players. Hands-on guidance for players who wish for it. Premade lists for easy start with your favorite characters from Star wars. Can host multiple head-to-head games simultaneously.",
    "start": "2025-08-13T00:00:00+02:00",
    "end": "2025-08-13T01:00:00+02:00",
    "room": "undetermined",
    "url": "",
    "type": "Game"
  },
  {
    "id": "9959cffa-3fc7-55bd-bb0b-55c9489232cd",
    "title": "FREE BIRD HOUR",
    "description": "Generated time to make session visible, might need an actual date and time\nAge range: 18+\nWe are listening to to \"Lynyrd Skynyrd - Free Bird\" for one hour on loop, which is about 6.7 times.\n\nThat's it.\n\nBring a camping chair, get your drink of choice and enjoy one hour of peak dad rock.",
    "start": "2025-08-13T00:00:00+02:00",
    "end": "2025-08-13T01:00:00+02:00",
    "room": "undetermined",
    "url": "",
    "type": "Other"
  },
  {
    "id": "3d3a9546-d65f-5a3e-a8d0-4bd9d0ada19e",
    "title": "Morse Code LED Blinker",
    "description": "Generated time to make session visible, might need an actual date and time\nAge range: Aimed at adults but supervised kids welcome.\nBored of talks? Burnt out on pixels? Swing by and solder.\nParticipants can assemble and program their very own blinky PCB — a tiny circuit that flashes their name in Morse. Whether you're new to electronics or just need a break from abstract systems talk, this project hits the sweet spot: tactile, nerdy, and extremely satisfying. And yes, you get to take it home.\n\nMore infos TBA!",
    "start": "2025-08-13T00:00:00+02:00",
    "end": "2025-08-13T01:00:00+02:00",
    "room": "undetermined",
    "url": "https://github.com/leandroebner/Morse-Code-LED-Blinker",
    "type": "Workshop"
  },
  {
    "id": "eba30b51-a7b4-5964-9c9f-80efccbfea9b",
    "title": "Fuzzing 5G NR FTW!",
    "description": "Generated time to make session visible, might need an actual date and time\nAge range: Aimed at adults but supervised kids welcome.\nThis is an ongoing project of mine that is not yet ready for the spotlight but i would like to start sharing with interested people.  \n\nIf you are interested in cellular security, wireless communications, SDR, 5G and so on, please let me know via email ot telegram (same username).",
    "start": "2025-08-13T00:00:00+02:00",
    "end": "2025-08-13T01:00:00+02:00",
    "room": "undetermined",
    "url": "",
    "type": "Talk"
  },
  {
    "id": "9b967496-1e7b-5473-ae3e-b08381b7b39a",
    "title": "Rust tutorial and Port Scanner",
    "description": "Generated time to make session visible, might need an actual date and time\nAge range: 16+",
    "start": "2025-08-13T00:00:00+02:00",
    "end": "2025-08-13T01:00:00+02:00",
    "room": "undetermined",
    "url": "https://wiki.why2025.org/Village:Green_Ninjas",
    "type": "Hands-On"
  },
  {
    "id": "4c06b457-324f-5d2c-b903-ca09d700f1f8",
    "title": "Forget all your previous instructions",
    "description": "Generated time to make session visible, might need an actual date and time\nAge range: 16+",
    "start": "2025-08-13T00:00:00+02:00",
    "end": "2025-08-13T01:00:00+02:00",
    "room": "undetermined",
    "url": "https://wiki.why2025.org/Village:Green_Ninjas",
    "type": "Talk"
  },
  {
    "id": "0c4eac16-9f2d-5972-b7af-96ba1ec4c4c3",
    "title": "Pwn Workshop",
    "description": "Generated time to make session visible, might need an actual date and time\nAge range: 16+",
    "start": "2025-08-13T00:00:00+02:00",
    "end": "2025-08-13T01:00:00+02:00",
    "room": "undetermined",
    "url": "https://wiki.why2025.org/Village:Green_Ninjas",
    "type": ""
  },
  {
    "id": "51a2c6fb-7de6-5417-8a0d-34ab02d5a40a",
    "title": "Hollywood-Style Smartlock Attack",
    "description": "Generated time to make session visible, might need an actual date and time\nAge range: 16+",
    "start": "2025-08-13T00:00:00+02:00",
    "end": "2025-08-13T01:00:00+02:00",
    "room": "undetermined",
    "url": "https://wiki.why2025.org/Village:Green_Ninjas",
    "type": ""
  },
  {
    "id": "33db1724-bb22-5f62-b2f3-529072f54149",
    "title": "Man your ships! Kubernetes Security, Attacks (and a Bit of Networking)",
    "description": "Generated time to make session visible, might need an actual date and time\nAge range: 16+",
    "start": "2025-08-13T00:00:00+02:00",
    "end": "2025-08-13T01:00:00+02:00",
    "room": "undetermined",
    "url": "https://wiki.why2025.org/Village:Green_Ninjas",
    "type": ""
  },
  {
    "id": "6514ca09-8d84-5eec-8cfd-c3ffc88a0ab0",
    "title": "How to (not) ace a Cyber Incident Response case",
    "description": "Generated time to make session visible, might need an actual date and time\nAge range: 16+",
    "start": "2025-08-13T00:00:00+02:00",
    "end": "2025-08-13T01:00:00+02:00",
    "room": "undetermined",
    "url": "https://wiki.why2025.org/Village:Green_Ninjas",
    "type": ""
  },
  {
    "id": "820236ab-39eb-50bb-8c1f-04df8ee8723d",
    "title": "How to Become a Red Teamer",
    "description": "Generated time to make session visible, might need an actual date and time\nAge range: 16+",
    "start": "2025-08-13T00:00:00+02:00",
    "end": "2025-08-13T01:00:00+02:00",
    "room": "undetermined",
    "url": "https://wiki.why2025.org/Village:Green_Ninjas",
    "type": "Talk"
  },
  {
    "id": "3de91bba-9c9d-547e-8d04-7703bcf3b935",
    "title": "Hacky Hunting!",
    "description": "Generated time to make session visible, might need an actual date and time\nAge range: 16+",
    "start": "2025-08-13T00:00:00+02:00",
    "end": "2025-08-13T01:00:00+02:00",
    "room": "undetermined",
    "url": "https://wiki.why2025.org/Village:Green_Ninjas",
    "type": ""
  },
  {
    "id": "f9c5bbcf-7c26-5c94-ad03-2f216d86bd61",
    "title": "Fuzz Testing in Go (for Funz and Profit)",
    "description": "Generated time to make session visible, might need an actual date and time\nAge range: 16+",
    "start": "2025-08-13T00:00:00+02:00",
    "end": "2025-08-13T01:00:00+02:00",
    "room": "undetermined",
    "url": "https://wiki.why2025.org/Village:Green_Ninjas",
    "type": "Hands-On"
  },
  {
    "id": "d5c89c8b-7c72-576c-bb8a-ca204c0f2d89",
    "title": "KubeVenom",
    "description": "Generated time to make session visible, might need an actual date and time\nAge range: 16+",
    "start": "2025-08-13T00:00:00+02:00",
    "end": "2025-08-13T01:00:00+02:00",
    "room": "undetermined",
    "url": "https://wiki.why2025.org/Village:Green_Ninjas",
    "type": "Talk"
  }
]